# CreateTransformed Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidUtils..::..CreateTransformed Method
SolidUtils Class See Also
---
Creates a new Solid which is the transformation of the input Solid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static Solid CreateTransformed(
	Solid solid,
	Transform transform
)
```

Visual Basic
---
```text
Public Shared Function CreateTransformed ( _
	solid As Solid, _
	transform As Transform _
) As Solid
```

Visual C++
---
```text
public:
static Solid^ CreateTransformed(
	Solid^ solid,
	Transform^ transform
)
```

# ### Parameters
solid
    Type: Autodesk.Revit.DB..::..Solid The input solid to be transformed.
transform
    Type: Autodesk.Revit.DB..::..Transform The transform (which must be conformal).
# ### Return Value
The newly created Solid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | transform is not conformal. -or- transform has a scale that is negative or zero. |

# See Also
SolidUtils Class
Autodesk.Revit.DB Namespace